#### Terraform Format and Style ``
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
module.k3s.module.infra.data.hcloud_location.loc: Reading...
module.k3s.module.infra.data.hcloud_location.loc: Read complete after 1s [name=fsn1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.custom will be created
  + resource "null_resource" "custom" {
      + id = (known after apply)
    }

  # module.k3s.module.infra.hcloud_firewall.default_firewall will be created
  + resource "hcloud_firewall" "default_firewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "k3s-arm-firewall"

      + rule {
          + description     = "allow all TCP on internal network"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = [
              + "10.0.0.0/16",
            ]
        }
      + rule {
          + description     = "allow all UDP on internal network"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = [
              + "10.0.0.0/16",
            ]
        }
      + rule {
          + description     = "allow icmp (ping)"
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "allow ssh access"
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # module.k3s.module.infra.hcloud_load_balancer.api_load_balancer will be created
  + resource "hcloud_load_balancer" "api_load_balancer" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = "lb11"
      + location           = "fsn1"
      + name               = "k3s-arm-api-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)
    }

  # module.k3s.module.infra.hcloud_load_balancer_network.srvnetwork will be created
  + resource "hcloud_load_balancer_network" "srvnetwork" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = "10.0.0.5"
      + load_balancer_id        = (known after apply)
      + network_id              = (known after apply)
    }

  # module.k3s.module.infra.hcloud_load_balancer_service.load_balancer_service will be created
  + resource "hcloud_load_balancer_service" "load_balancer_service" {
      + destination_port = 6443
      + id               = (known after apply)
      + listen_port      = 6443
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)
    }

  # module.k3s.module.infra.hcloud_load_balancer_target.api_load_balancer_target will be created
  + resource "hcloud_load_balancer_target" "api_load_balancer_target" {
      + id               = (known after apply)
      + label_selector   = "node-type=k3s-arm-main"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # module.k3s.module.infra.hcloud_network.network will be created
  + resource "hcloud_network" "network" {
      + delete_protection        = false
      + expose_routes_to_vswitch = false
      + id                       = (known after apply)
      + ip_range                 = "10.0.0.0/16"
      + name                     = "k3s-arm-net"
    }

  # module.k3s.module.infra.hcloud_network_subnet.network-subnet will be created
  + resource "hcloud_network_subnet" "network-subnet" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.0.0/16"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # module.k3s.module.infra.hcloud_placement_group.main will be created
  + resource "hcloud_placement_group" "main" {
      + id      = (known after apply)
      + name    = "k3s-arm-main-group"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.k3s.module.infra.hcloud_placement_group.worker will be created
  + resource "hcloud_placement_group" "worker" {
      + id      = (known after apply)
      + name    = "k3s-arm-worker-group"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.k3s.module.infra.hcloud_server.main-node[0] will be created
  + resource "hcloud_server" "main-node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-11"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "node-type" = "k3s-arm-main"
        }
      + location                   = "fsn1"
      + name                       = "k3s-arm-main-0"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cax11"
      + ssh_keys                   = [
          + "k3s-arm-ssh",
        ]
      + status                     = (known after apply)
      + user_data                  = "1T0ydPTdZZkOtTodLjveqBHOwf8="
    }

  # module.k3s.module.infra.hcloud_server.worker-node[0] will be created
  + resource "hcloud_server" "worker-node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-11"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "node-type" = "k3s-arm-worker"
        }
      + location                   = "fsn1"
      + name                       = "k3s-arm-worker-0"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cax11"
      + ssh_keys                   = [
          + "k3s-arm-ssh",
        ]
      + status                     = (known after apply)
      + user_data                  = "1T0ydPTdZZkOtTodLjveqBHOwf8="
    }

  # module.k3s.module.infra.hcloud_server.worker-node[1] will be created
  + resource "hcloud_server" "worker-node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-11"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "node-type" = "k3s-arm-worker"
        }
      + location                   = "fsn1"
      + name                       = "k3s-arm-worker-1"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cax11"
      + ssh_keys                   = [
          + "k3s-arm-ssh",
        ]
      + status                     = (known after apply)
      + user_data                  = "1T0ydPTdZZkOtTodLjveqBHOwf8="
    }

  # module.k3s.module.infra.hcloud_server_network.main-node-network[0] will be created
  + resource "hcloud_server_network" "main-node-network" {
      + id          = (known after apply)
      + ip          = "10.0.0.10"
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.k3s.module.infra.hcloud_server_network.worker-node-network[0] will be created
  + resource "hcloud_server_network" "worker-node-network" {
      + id          = (known after apply)
      + ip          = "10.0.0.100"
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.k3s.module.infra.hcloud_server_network.worker-node-network[1] will be created
  + resource "hcloud_server_network" "worker-node-network" {
      + id          = (known after apply)
      + ip          = "10.0.0.101"
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.k3s.module.infra.hcloud_ssh_key.default will be created
  + resource "hcloud_ssh_key" "default" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "k3s-arm-ssh"
      + public_key  = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC7VuYtXSdXGkxtT1134XWAktxgemzHzEVQmmUhJuHivzTxK2taWK/Gv7TC61sxuDJtK6aG391Slsy2kvPQW+1z2AUBNsmvHUbjMAQir5DJvCXHakn3IZctM9IRoIosG1s8dQQVEFya3rz62UiZfBXrdGHuZVtYDyoyRrVq2rsUmq4r9hNSqrGaoyZsDOf0TERmPlIIy7EFUp1bVko+a1I7CiiztaGcoha2ZE/hQd3+fWGcXQKV6RlZlU46ecbmX+OnAVcQkoZseJiNt3ckJC0filsQjk4+7ZbvnEgNhy0G9/3zhc4plRHWSwiKGvPqWlYiVKRjBtfJYTXRMJ2oHeJ0lucJ0gdWwzIfTvixe628mThY1nMZczrME78TxPLOP6SIRbJmBRJtB2WfxUoN1hfMPjBgxttKY5fo8QxIs+Xj1PhcxtfIKeO+TkLGlWHZ/bbS2/6pRkXxJ2ryoJMNsHWrIXW9KfkiqLH2ifec+t/fPdtBA4KM+lw6RoILCLky4yk= andrzej@macbook-esky.local
        EOT
    }

  # module.k3s.module.k3s.null_resource.ccm will be created
  + resource "null_resource" "ccm" {
      + id       = (known after apply)
      + triggers = {
          + "first_main_ip" = (known after apply)
        }
    }

  # module.k3s.module.k3s.null_resource.cluster_init will be created
  + resource "null_resource" "cluster_init" {
      + id       = (known after apply)
      + triggers = {
          + "first_main_ip" = (known after apply)
        }
    }

  # module.k3s.module.k3s.null_resource.csi will be created
  + resource "null_resource" "csi" {
      + id       = (known after apply)
      + triggers = {
          + "first_main_ip" = (known after apply)
        }
    }

  # module.k3s.module.k3s.null_resource.k3s_upgrade[0] will be created
  + resource "null_resource" "k3s_upgrade" {
      + id       = (known after apply)
      + triggers = {
          + "upgrade_k3s" = "v1.26.4+k3s1"
        }
    }

  # module.k3s.module.k3s.null_resource.upgrade_controller will be created
  + resource "null_resource" "upgrade_controller" {
      + id       = (known after apply)
      + triggers = {
          + "first_main_ip" = (known after apply)
        }
    }

  # module.k3s.module.k3s.null_resource.worker_init[0] will be created
  + resource "null_resource" "worker_init" {
      + id       = (known after apply)
      + triggers = {
          + "worker_ip" = (known after apply)
        }
    }

  # module.k3s.module.k3s.null_resource.worker_init[1] will be created
  + resource "null_resource" "worker_init" {
      + id       = (known after apply)
      + triggers = {
          + "worker_ip" = (known after apply)
        }
    }

  # module.k3s.module.k3s.random_id.k3s_token will be created
  + resource "random_id" "k3s_token" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AndrzejOlender, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*